common/models/User.php

SELECT * FROM `ls_user` WHERE `id`=5
---
    public static function findIdentity($id)
    {
    	return User::findOne(['id'=>$id]);